Revit 2027 API
ConnectionInputPointInfo(String, Int32, String) Constructor
 Construct an input point info.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectionInputPointInfo(
	string ptSelectionText,
	int inputMemberIndex,
	string restrictionType
)
Public Sub New (
	ptSelectionText As String,
	inputMemberIndex As Integer,
	restrictionType As String
)
public:
ConnectionInputPointInfo(
	String^ ptSelectionText,
	int inputMemberIndex,
	String^ restrictionType
)
new :
        ptSelectionText : string *
        inputMemberIndex : int *
        restrictionType : string -> ConnectionInputPointInfo
Parameters
ptSelectionText String
inputMemberIndex Int32
restrictionType String
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ConnectionInputPointInfo Class
ConnectionInputPointInfo Overload
Autodesk.Revit.DB.Structure Namespace